_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 24, 24, 25)        650       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 24, 24, 25)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 25)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 50)          31300     
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 8, 8, 50)          0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 50)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 800)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               80100     
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 100)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                1010      
=================================================================
Total params: 113,060
Trainable params: 113,060
Non-trainable params: 0
_________________________________________________________________
